[
  {
    "path": "posts/2021-01-16-what-i-read-in-2020-my-ratings-versus-goodreads/",
    "title": "What I read in 2020: My ratings versus Goodreads",
    "description": "How well do my book ratings line up to the Goodreads community ratings?",
    "author": [
      {
        "name": "Gary Lynch",
        "url": "https://gary-lynch.github.io/"
      }
    ],
    "date": "2021-01-16",
    "categories": [],
    "contents": "\r\nIntroduction\r\n2020 ended up being a uniquely good year for reading (at least for me). Multiple lockdown left me with lots of reading time and for the first time I kept track of what I read during the year.\r\nI thought it would be interesting to share some of what I tracked by answering a couple of questions. Mainly, I want to see how my ratings compare to the average reader (for this, I used Goodreads average reviews). I don’t use the site myself, but its a great proxy for the general consensus on a book.\r\nThe questions I’d like to answer are as follows:\r\nHow did my ratings compare with Goodreads average ratings?\r\nWhat books did I like more than Goodreads readers?\r\nWhat books did Goodreads readers like more than me?\r\n\r\n\r\n\r\nHow do my ratings stack up against Goodreads?\r\nThe below graph represents the 40 books I read in 2020. Each point relates to one book, with the horizontal axis showing the Goodreads average rating and the vertical axis showing my rating. I’ve added a line to highlight the points where my rating matches the Goodreads rating (Note: You can hover over any point to see the book it relates to).\r\n \r\n\r\npreserve1c1d52b1c36e6cba\r\n\r\nAs you can see, only 2 of 40 books had a matched rating. That said, most of the ratings were fairly close, with the majority within 0.5 of the other rating. There were a few notable exceptions, which I’ll go into more detail on below.\r\nI was surprised to see that nearly every non-fiction book I read was rated higher on Goodreads. I have a feeling this has more to do with Goodreads ratings than to do with me (did you notice that the majority of +4 star Goodreads reviewed books are non-fiction?). Maybe I just exclusively read great non-fiction?\r\nIn the next section, we’ll look at the books with the greatest difference in ratings - starting with books I liked more than Goodreads.\r\nBooks I liked more than Goodreads\r\n\r\n\r\nTitle\r\n\r\n\r\nAuthor\r\n\r\n\r\nMy.Rating\r\n\r\n\r\nGood.Reads.Rating\r\n\r\n\r\nDifference\r\n\r\n\r\nThe Memory Police\r\n\r\n\r\nYoko Ogawa\r\n\r\n\r\n4.9\r\n\r\n\r\n3.8\r\n\r\n\r\n1.1\r\n\r\n\r\nIf Cats Disappeared From The World\r\n\r\n\r\nGenki Kawamura\r\n\r\n\r\n4.4\r\n\r\n\r\n3.7\r\n\r\n\r\n0.7\r\n\r\n\r\nNormal People\r\n\r\n\r\nSally Rooney\r\n\r\n\r\n4.5\r\n\r\n\r\n3.9\r\n\r\n\r\n0.6\r\n\r\n\r\nThe Color Purple\r\n\r\n\r\nAlice Walker\r\n\r\n\r\n4.7\r\n\r\n\r\n4.2\r\n\r\n\r\n0.5\r\n\r\n\r\nFrankenstein\r\n\r\n\r\nMary Shelley\r\n\r\n\r\n4.3\r\n\r\n\r\n3.8\r\n\r\n\r\n0.5\r\n\r\n\r\nThe Memory Police: This was hands down the best book I read in 2020, so I expected this to exceed the Goodreads rating. Definitely not a book for everyone, but a good pick if you enjoy allegorical fiction.\r\nIf Cats Disappeared from the World: A short read that packs an emotional punch. It starts quite lighthearted and slowly reveals itself to you. I was quite surprised that Goodreads readers didn’t like this more.\r\nNormal People: The best-selling novel that is now a major television series. This hit very close to home for me, not least because its set in the university I went to. Worth reading for the culture impact alone or as preparation for watching the TV show.\r\nThe Color Purple: Alice Walker’s Pulitzer prize winning novel is a classic for a reason. This moved me more than anything else I read this this year. I found it remarkably relevant to current day issues for a novel from the 1980’s.\r\nFrankenstein: Mary Shelley’s classic had a much lower Goodreads rating than I expected. A landmark novel that is very readable for something written over 200 years ago.\r\nBooks preferred by Goodreads readers\r\n\r\n\r\nTitle\r\n\r\n\r\nAuthor\r\n\r\n\r\nMy.Rating\r\n\r\n\r\nGood.Reads.Rating\r\n\r\n\r\nDifference\r\n\r\n\r\nLittle Fires Everywhere\r\n\r\n\r\nCeleste Ng\r\n\r\n\r\n2.4\r\n\r\n\r\n4.1\r\n\r\n\r\n-1.7\r\n\r\n\r\nFreedom\r\n\r\n\r\nMargaret Atwood\r\n\r\n\r\n2.0\r\n\r\n\r\n3.4\r\n\r\n\r\n-1.4\r\n\r\n\r\nThe Cuckoo’s Calling\r\n\r\n\r\nRobert Galbraith\r\n\r\n\r\n2.6\r\n\r\n\r\n3.9\r\n\r\n\r\n-1.3\r\n\r\n\r\nWhen All Is Said\r\n\r\n\r\nAnne Griffin\r\n\r\n\r\n2.9\r\n\r\n\r\n4.0\r\n\r\n\r\n-1.1\r\n\r\n\r\nSputnik Sweetheart\r\n\r\n\r\nHaruki Murakami\r\n\r\n\r\n3.0\r\n\r\n\r\n3.8\r\n\r\n\r\n-0.8\r\n\r\n\r\nLittle Fires Everywhere: Another best-selling novel that is now a major television series. I think I may have had too high expectations for this. I didn’t hate this but the story just went in a direction story-wise that I didn’t enjoy.\r\nFreedom: I didn’t realise when I bought this that it’s actual a collection of excerpts from other Atwood novels. Unfortunately, I had read most of these novels before. Not an awful book, but I’d recommend just reading her actual novels instead.\r\nThe Cuckoo’s Calling: This is the first in a series of murder mystery novels from J.K. Rowling. I found it fine as a read, if a little long. Obviously Goodreads readers enjoyed it more than I did.\r\nWhen All is Said: Anne Griffin does a great job capturing life in Ireland here. I enjoyed reading this, but it was closer to a 3 than a 4 star for me.\r\nSputnik Sweetheart: I am a big Murakami fan. This was not my favorite of his, but it does have some beautiful description. If you’re interested in trying Murakami, I would probably start with something else (Norwegian Wood, Kafka on the Shore).\r\nFinal thoughts\r\nThis was a fun little experiment in plotting my reading for 2020. As a bonus, I’ve included the number of books I read each month below. You can probably guess when college started based on how my reading fell off a cliff!\r\n\r\n\r\n\r\nIf you’re interested in doing something similar to this, all the graphs were created in R Markdown. The first graph utilized the Rbokeh package and the tables use the Kable extra package. This blog was compiled using the distill package and is hosted on Github pages.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "https://gary-lynch.github.io/index_files/figure-html5/rbokeh2-1.png",
    "last_modified": "2021-01-16T23:39:08+00:00",
    "input_file": "what-i-read-in-2020-my-ratings-versus-goodreads.utf8.md"
  }
]
